app/views/includes/_search_frontend.erb

SELECT `categories`.* FROM `categories`
---
      <div class="form-group">
        <%= select_tag "category_id", options_for_select(Category.all.collect {|p| [p['name'], p['id']]}, :selected=>@search[:category_id] || @search[:id]),include_blank: "Choose Category", class: 'selectpicker form-control' %>