app/controllers/site_controller.rb

  def index
    # @products = Product.where('status = 1').order('created_at desc').paginate(:page => params[:page], :per_page => 10)
    @products = Product.search(params).paginate(:page => params[:page], :per_page => 9)
---
SELECT  `products`.* FROM `products`  ORDER BY created_at desc LIMIT 9 OFFSET 0