app/controllers/trade_marks_controller.rb

SELECT  `trade_marks`.* FROM `trade_marks` WHERE `trade_marks`.`id` = NULL LIMIT 1
---
    def set_trade_mark
      @trade_mark = TradeMark.find(params[:id])